# Початок циклу роботи бота
while True:
    # Виведення запиту на введення фрази
    input_str = input('Що ви хочете сказати? ')
    # Ініціалізація змінної, необхідної для визначення того, чи були введені ключові слова, чи ні
    temp_int = 0
    # Перевірка введеної фрази на наявність привітання
    if 'привіт' in input_str.lower() \
            or 'хай' in input_str.lower() \
            or 'доброго дня' in input_str.lower():
        # Виведення на екран привітання від бота
        print('Доброго вечора, я бот з України!')
        temp_int = 1
    # Перевірка введеної фрази на наявність питання
    if 'як справи?' in input_str.lower() \
            or 'що робиш?' in input_str.lower() \
            or 'чим займаєшся?' in input_str.lower():
        # Виведення на екран відповіді від бота
        print('Вчусь програмувати на Python!')
        temp_int = 1
    # Перевірка введеної фрази на наявність слів про фільми
    if 'фільм' in input_str.lower() \
            or 'кінотеатр' in input_str.lower() \
            or 'серіал' in input_str.lower():
        # Виведення на екран рекомендації від бота по фільму
        print('Соррі що втручуюсь, не знаю про що йдеться мова, '
              'але подивіться фільм "Моя відповідь :)", він просто бомба!')
        temp_int = 1
    # Перевірка введеної фрази на наявність прощання
    if 'бувай' in input_str.lower() \
            or 'на добраніч' in input_str.lower() \
            or 'гудбай' in input_str.lower() \
            or 'до зустрічі' in input_str.lower():
        # Виведення на екран прощання та завершення розмови
        print("Побачимось у мережі, I'll be back.")
        exit(0)
    # Якщо не було знайдено ключових слів (temp_int = 0), то бот виведе повідомлення
    if temp_int == 0:
        print('Дуже цікаво, але, нажаль, нічого не зрозуміло :(')