import time

i = 0

while i < 10:
    i += 1
    print(i)

big_text = """
Python (найчастіше вживане прочитання — «Па́йтон», запозичено назву[7] з британського шоу Монті Пайтон) — 
інтерпретована об'єктно-орієнтована мова програмування високого рівня зі строгою динамічною типізацією.
[8] Розроблена в 1990 році Гвідо ван Россумом. Структури даних високого рівня разом із динамічною 
семантикою та динамічним зв'язуванням роблять її привабливою для швидкої розробки програм, а також як 
засіб поєднування наявних компонентів. Python підтримує модулі та пакети модулів, що сприяє модульності та 
повторному використанню коду. Інтерпретатор Python та стандартні бібліотеки доступні як у скомпільованій, 
так і у вихідній формі на всіх основних платформах. В мові програмування Python підтримується кілька парадигм 
програмування, зокрема: об'єктно-орієнтована, процедурна, функціональна та аспектно-орієнтована.
"""

search_query = 'в'
search_index = 0
print(f"Searching '{search_query}':")
while True:
    search_index = big_text.find(search_query, search_index)
    if search_index == -1:
        break
    print(search_index)
    search_index += 1
    time.sleep(0.3)
