# Імпортування бібліотеки "re" для необхідного нам методу sub()
import re

# Виведення запиту на введення рядку
input_str = input('Введіть ваш рядок: ')

# Початок операцій з рядком
# Позбавлення розділових знаків, перетворення у нижній регістр та позбавлення пробілів з обох сторін
# Метод sub() поверне рядок без вказаних у 1-му аргументі символів
res_str = re.sub('[ .,:;?!"\-\'\n\t]', '', input_str).lower().strip()
print(res_str)

inv_str = res_str[::-1]                         # Інвертація зміненого рядка
print(inv_str)

if res_str == "":                               # Перевірка чи рядок не порожній
    print("Ви не ввели достатньо символів :/")
else:
    if res_str == inv_str:                      # Порівняння зміненого введеного рядка з інвертованим
        print("Введений рядок є паліндромом!")
    else:
        print("Цей рядок не є паліндромом :(")